org/emacs-org-mode.md

# Table of Contents

1.  [Task List](#org527abb0)
    1.  [Make an Emacs Org GUIDE](#orge8a51e6)
    2.  [do multiple things in one task <code>[1/5]</code> <code>[20%]</code>](#orgb65cae4)
    3.  [Org Agenda SPC-o-A](#orgab0eedd)
    4.  [SPC-X for Capture Mode](#org1da37a5)



<a id="org527abb0"></a>

# Task List


<a id="orge8a51e6"></a>

## TODO Make an Emacs Org GUIDE

-   SPC-m-t-# marks a line as TODO
-   SPC-m-d-s opens org-schedule for a section
-   RET => toggle TODO & DONE


<a id="orgb65cae4"></a>

## TODO do multiple things in one task <code>[1/5]</code> <code>[20%]</code>

-   [ ] CTRL + RET => add new item
-   [ ] C-c C-c => toggle Box
-   [X] SPC-m-x => same thing (space mark X)
-   [ ] add <code>[0/0]</code> to the head => automatically adds [0/X]
-   [-] for sub tasks
    -   [-] you can do them easily
    -   [ ] when they&rsquo;re finished the one up is finished


<a id="orgab0eedd"></a>

## PROJ Org Agenda SPC-o-A

-   a = agenda for current week (what you scheduled)
-   t = todo items not done
    -   t => toggle state

-   s = search by keyword
    -   you can use regex!


<a id="org1da37a5"></a>

## PROJ SPC-X for Capture Mode

-   j => Journal
-   n => notes
-   t => to-do&rsquo;s
-   p => local
    -   to-do&rsquo;s
    -   notes
    -   change-log

